chriskinal/QuailTracker/esp32_bridge/src/main.c
        spi_slave_transaction_t trans = {
            .length = TRANSFER_SIZE * 8,
            .tx_buffer = spi_txBuf,
            .rx_buffer = spi_rxBuf,
        };

        esp_err_t ret = spi_slave_transmit(SPI_HOST, &trans, pdMS_TO_TICKS(1000));
        vTaskDelay(pdMS_TO_TICKS(1));  /* yield to lower-priority tasks */
        if (ret == ESP_OK) {
            spi_transaction_count++;

            int len = trans.trans_len / 8;
            if (len > TRANSFER_SIZE) len = TRANSFER_SIZE;
            if (len > 0 && spi_rxBuf[0] == '{') {
                /* JSON status from STM32 — store and flag for broadcast */
                memcpy(last_spi_msg, spi_rxBuf, len);
                last_spi_msg[len] = '\0';
                new_spi_data = true;

                /* Extract battery/state for BLE advertising */
                last_battery_mv = (uint16_t)json_get_int(last_spi_msg, "bat", 0);
                last_recording = (uint8_t)json_get_int(last_spi_msg, "rec", 0);
                last_pwr_state = (uint8_t)json_get_int(last_spi_msg, "pwrState", 0);

                /* Update device name from station ID if changed */
                {
                    char station[16];
                    if (json_get_str(last_spi_msg, "station", station, sizeof(station))
                        && station[0]) {
                        update_device_name(station);
                    }
                }

                /* Check for sleep command from STM32 */
                if (json_get_int(last_spi_msg, "sleeping", -1) == 1) {
                    ESP_LOGI(TAG, "STM32 entering sleep — switching to LOW_POWER");
                    stm32_sleeping = true;
                    bridge_state = BRIDGE_LOW_POWER;
                }

                /* Match ESP32 power state to STM32 power state.
                 * PWR_SCHEDULED_NONREC (0) = STM32 sleeping → ESP32 LOW_POWER
                 * PWR_DEV_MODE (3) or PWR_USER_CONNECTED (2) = ESP32 NORMAL_POWER
                 * PWR_SCHEDULED_REC (1) = recording, no user → ESP32 LOW_POWER */
                if (!ble_beacon_is_connected()) {
                    if (last_pwr_state == 2 || last_pwr_state == 3) {
                        if (bridge_state == BRIDGE_LOW_POWER) {
                            bridge_state = BRIDGE_NORMAL_POWER;
                            ESP_LOGI(TAG, "STM32 user/dev mode — NORMAL_POWER");
                        }
                    } else {
                        if (bridge_state == BRIDGE_NORMAL_POWER && disconnect_tick == 0) {
                            bridge_state = BRIDGE_LOW_POWER;
                            ESP_LOGI(TAG, "STM32 sleep/rec mode — LOW_POWER");
                        }
                    }
                }

                ESP_LOGI(TAG, "SPI rx len=%d", len);
            }
        }
    }
}

/* ── WebSocket Push Task ───────────────────────────────────────── */

static void ws_push_task(void *arg)
{
    while (1) {
        vTaskDelay(pdMS_TO_TICKS(500));

        if (new_spi_data && ws_server) {
            new_spi_data = false;
            /* Inject ESP32 firmware version into JSON before broadcasting.
             * Replace trailing '}' with ',"espFw":"x.y.z"}' */
            int len = strlen(last_spi_msg);
            if (len > 1 && last_spi_msg[len - 1] == '}') {
                snprintf(last_spi_msg + len - 1,
                         sizeof(last_spi_msg) - len + 1,
                         ",\"espFw\":\"%s\"}", ESP_FW_VERSION);
            }
            ws_broadcast(last_spi_msg);
        }

        /* Update BLE advertising data periodically */
        ble_beacon_update_data(last_battery_mv, last_recording, last_pwr_state);
    }
}

/* ── BLE Callbacks ─────────────────────────────────────────────── */

static void on_ble_connect(void)
{
    ESP_LOGI(TAG, "BLE client connected — transitioning to NORMAL_POWER");
    bridge_state = BRIDGE_NORMAL_POWER;
    disconnect_tick = 0;

    /* Wake STM32 if it's sleeping */
    if (stm32_sleeping) {
        stm32_wake();
    }
}

static void on_ble_disconnect(void)
{
    ESP_LOGI(TAG, "BLE client disconnected — starting 30s timeout");
    disconnect_tick = xTaskGetTickCount();
}

/* ── Power Management Task ─────────────────────────────────────── */

static void power_mgmt_task(void *arg)
{
    bridge_power_t prev_state = BRIDGE_LOW_POWER;

    while (1) {
        vTaskDelay(pdMS_TO_TICKS(1000));

        /* Check if any WiFi clients are connected */
        wifi_sta_list_t sta_list;
        int wifi_clients = 0;
        if (wifi_started && esp_wifi_ap_get_sta_list(&sta_list) == ESP_OK) {
            wifi_clients = sta_list.num;
        }

        /* Handle BLE disconnect timeout — only if no WiFi clients connected */
        if (disconnect_tick != 0 && !ble_beacon_is_connected() && wifi_clients == 0) {
            uint32_t elapsed = (xTaskGetTickCount() - disconnect_tick) * portTICK_PERIOD_MS;
            if (elapsed >= BLE_DISCONNECT_TIMEOUT_MS) {
                ESP_LOGI(TAG, "BLE disconnect timeout — switching to LOW_POWER");
                bridge_state = BRIDGE_LOW_POWER;
                disconnect_tick = 0;
            }
        }

        /* Reset timeout while WiFi clients are connected */
        if (wifi_clients > 0 && disconnect_tick != 0) {
            disconnect_tick = xTaskGetTickCount();  /* keep extending */
        }

        /* If BLE reconnected, cancel timeout */
        if (ble_beacon_is_connected() && disconnect_tick != 0) {
            disconnect_tick = 0;
        }

        /* Handle state transitions */
        if (bridge_state != prev_state) {
            if (bridge_state == BRIDGE_NORMAL_POWER) {
                /* Start WiFi + web server + SPI */
                wifi_start();
                start_webserver();
                spi_slave_init();
                ESP_LOGI(TAG, "NORMAL_POWER: WiFi + WebServer + SPI active");
            } else {
                /* Stop WiFi + web server (SPI stays for wake detection) */
                wifi_stop();
                ESP_LOGI(TAG, "LOW_POWER: BLE only");
            }
            prev_state = bridge_state;
        }
    }
}

/* ── Main ──────────────────────────────────────────────────────── */

