chriskinal/QuailTracker/esp32_bridge/src/main.c
void app_main(void)
{
    printf("\n=== ESP32-C3 QuailTracker Bridge v2 ===\n\n");

    /* FIRST: release STM32 BOOT0/NRST pins to high-Z */
    stm32_pins_init();

    /* Initialize NVS (required for WiFi + BLE) */
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ESP_ERROR_CHECK(nvs_flash_init());
    }

    /* Load device name: NVS first, then fall back to MAC-based default */
    if (!load_device_name()) {
        uint8_t mac[6];
        esp_read_mac(mac, ESP_MAC_WIFI_STA);
        snprintf(device_name, sizeof(device_name), "QT_%02X%02X", mac[4], mac[5]);
        ESP_LOGI(TAG, "No saved name, using default: %s", device_name);
    }

    /* Initialize network interface (needed before WiFi or BLE) */
    wifi_init_netif();

    /* Start BLE beacon (always active for device discovery) */
    ble_beacon_init(device_name, on_ble_connect, on_ble_disconnect);

    /* Start in NORMAL_POWER on boot so WiFi AP is available for setup.
     * Will transition to LOW_POWER after BLE disconnect timeout if no
     * user is connected, or when STM32 sends sleep command. */
    bridge_state = BRIDGE_NORMAL_POWER;
    wifi_start();
    start_webserver();
    spi_slave_init();

    xTaskCreate(spi_task, "spi_task", 4096, NULL, 3, &spi_task_handle);
    xTaskCreate(ws_push_task, "ws_push", 4096, NULL, 4, NULL);
    xTaskCreate(power_mgmt_task, "pwr_mgmt", 4096, NULL, 2, NULL);

    ESP_LOGI(TAG, "Bridge ready — BLE Beacon + WiFi AP + SPI + WebSocket");
}
